{
    "header": "<header><h1>Welcome to El-Ka코tan Wiki</h1></header>",
    "navBar": "<nav><ul><li><a href=\"index.html\">Basic Info</a></li><li><a href=\"rules.html\">Game Rules</a></li><li><a href=\"strategy.html\">Strategy</a></li><li><a href=\"videogame.html\">Playable Demo</a></li><div id=\"lngDrop\"></div></ul></nav>",
    "footer":"<footer><p>&copy; 2025 El-Ka코tan. All rights reserved.</p></footer>",
    "indexTitle" : "El-Ka코tan main site",
    "rulesTitle" : "El-Ka코tan rules",
    "strategyTitle" : "El-Ka코tan strategy",
    "vidgameTitle" : "El-Ka코tan playable demo",
    "notDone" : "<p style=\"color: red\">游뚾 Under construction 游뚾</p>",

    "IInfo":"<h2>Game Description</h2><p><strong>El-Ka코tan</strong> is a turn-based strategy game for two players. Players take turns making moves on the game board. The goal is to force the opponent to accumulate 4 penalty points.</p><h2>Game Board</h2><p>The game board has an L-shape (4x4 grid with a missing 2x2 corner). Each player starts with four numbered pieces (1-4) in their respective corners, and four numbered cards. Players also have a supplementary card deck.</p><h2>Supplementary Deck</h2><p>The supplementary deck contains 4 cards:<ul><li>2 diagonal movement cards</li><li>1 two-square move card</li><li>1 card for moving a piece to any square</li></ul>Players draw cards at the beginning and can use them during their turns. Once a card is used, it is removed from the deck.</p><h2>Objective</h2><p>The objective of the game is to make your opponent accumulate 4 penalty points.</p><h2>Gameplay</h2><p>On their turn, a player flips a numbered card and moves the corresponding piece to an empty adjacent square. Players can also use cards from their supplementary deck for special moves. If a player cannot move a piece, they must discard it and draw a card, earning 1 penalty point. Once all cards are used, they are flipped back and the game continues.</p><h2>Game Table</h2><table class=\"game-table\"><tr><th>Phase</th><th>Description</th></tr><tr><td>1</td><td>Players start by selecting their pieces and preparing the supplementary deck.</td></tr><tr><td>2</td><td>Players take turns flipping a numbered card, moving pieces, and using supplementary cards.</td></tr><tr><td>3</td><td>If a player cannot move a piece, they discard it and draw a card, earning a penalty point.</td></tr><tr><td>4</td><td>The first player to force their opponent to accumulate 4 penalty points wins!</td></tr></table>",

    "VGdownloadTitle" : "El-Ka코tan demo game",
    "VGdownloadIntro" : "Below you can download El-Ka코tan for your operating system.",
    "VGdownloadNow" : "Download",
    "VGdownloadWinDesc" : "For 64-bit Windows. Just unzip and run the .exe. No installation required.",
    "VGdownloadLinuxDesc" : "Tested on ... distros. Just uzip and run the binary.",
    "VGsourceCode" : "Source Code",
    "VGdownloadSrcDesc" : "Download the full source code if you want to build or inspect the project.",
    "VGdownloadNote" : "There isnt any real demo yet, but i hope that will change."
}
